import java.util.*;
/**
 * Γράψτε μια περιγραφή της κλάσης User εδώ.
 * 
 * @author (Το όνομά σας) 
 * @version (Αριθμός έκδοσης ή ημερομηνία εδώ)
 */
public class User
{
    // μεταβλητές στιγμιοτύπου - αντικαταστήστε το ακόλουθο παράδειγμα
    // με τις δικές σας μεταβλητές
    
    int id;
    Profile profile;
    List<String> notifications=new ArrayList<String>();

    /**
     * Κατασευαστής αντικειμένων της κλάσης User
     */
    public User()
    {
        // αρχικοποίηση μεταβλητών στιγμιοτύπου
        
    }

    /**
     * Παράδειγμα μεθόδου - αντικαταστήστε το παρόν σχόλιο με το δικό σας
     * 
     * @param  y    παράδειγμα παραμέτρου για την μέθοδο
     * @return        το άθροισμα του x με το y 
     */
    public void sampleMethod(int y)
    {
        // Γράψτε τον κώδικα σας εδώ
        
    }
}
